{
  "ticket_id": "7f10236cad9dc062",
  "ticket_key": "MANUAL-001",
  "title": " [FE] Trigger native app rating prompt after advisory completion (next app open at Home)",
  "description": "Acceptance Criteria:\n\nGiven user has completed an advisory session (any type)\nWhen user opens the app again and arrive at Sessions screen (list of sessions)\nThen a native app rating prompt appear to ask user to review the app\n\nThis screen → https://www.figma.com/design/fnCxddHpd5tOcjYxzliAxc/Habitto-App-UI--Sprint-Execution?node-id=142309-153765&t=vdTAvHO1HiJbBMdM-0\n\nFigma Links:\nhttps://www.figma.com/design/lnLBUIYkFK6IIQ1HjDyw4N/Habitto-AI-Assistant---Chat-Revamp--Copy-?t=0zPHb1SkAXCZSBL2-0",
  "priority": "Medium",
  "assignee": "Unassigned",
  "reporter": "You",
  "labels": [],
  "components": [],
  "figma_links": [
    "https://www.figma.com/design/lnLBUIYkFK6IIQ1HjDyw4N/Habitto-AI-Assistant---Chat-Revamp--Copy-?t=0zPHb1SkAXCZSBL2-0",
    "https://www.figma.com/design/fnCxddHpd5tOcjYxzliAxc/Habitto-App-UI--Sprint-Execution?node-id=142309-153765&t=vdTAvHO1HiJbBMdM-0"
  ],
  "created_at": "2025-09-11T23:33:23.546862",
  "updated_at": "2025-09-11T23:33:23.546865",
  "suggested_questions": [
    "How should the completion of an advisory session be tracked within the app? Is there a specific flag or status that is updated upon session completion?",
    "Does the native app rating prompt need to appear immediately upon returning to the Sessions screen, or is there a delay or condition for its display?",
    "What specific criteria trigger the appearance of the native app rating prompt? Is it based on the number of completed sessions, a specific type of advisory session, or other factors?",
    "Are there any specific requirements or restrictions for the app rating prompt, such as minimum rating value, custom message, or redirection after rating submission?",
    "Should the native app rating prompt be dismissible by the user, or does it require a rating action before the user can proceed?",
    "Are there any specific design or layout considerations from the Figma link provided that need to be implemented in the native app rating prompt?",
    "Is there any existing functionality or user flow that needs to be disabled or modified when the native app rating prompt is displayed on the Sessions screen?",
    "How should the app handle scenarios where the user has already rated the app before? Should the prompt still appear, or should it be suppressed for users who have already rated the app?",
    "Are there any specific analytics or tracking requirements related to the native app rating prompt, such as recording when the prompt is displayed, user interactions, or ratings submitted?",
    "Will the native app rating prompt be a one-time occurrence for each user, or should it appear periodically or under certain conditions for continuous user feedback?",
    "Are there any localization or language considerations for the text displayed in the native app rating prompt, especially if the app is used in multiple regions?",
    "How will the integration between the app and the native rating system be handled to ensure a seamless user experience and accurate tracking of ratings and reviews?"
  ],
  "design_questions": [
    "For the \"Habitto AI Assistant Intro Screen,\" how is the microphone permission request visually presented to the user in JP/AIA/IntroScreen/3/MicrophonePermisson? Are there any accessibility considerations for this prompt?",
    "In the \"Advisor Profile\" screen, how is the information about the advisor displayed? Are there any specific UI components used to showcase the advisor's details effectively?",
    "Could you elaborate on the user flow for the \"AI Assistant Waitlist Mechanism\"? How does the user interact with this feature, and what screens are involved in this flow?",
    "In the \"Abstract Form\" component, how is user input captured and validated? Are there error states designed for incorrect form submissions?",
    "How is the \"Action Button\" component styled across different screens like in Sequential Flow: Screenshot 2025-05-30 at 13.21.52 1? Is there a consistent design pattern for primary and secondary actions?",
    "When a user agrees to cross-sales compliance consent, how is this confirmation visually represented in the UI? Is there a standardized approach to displaying consent confirmations throughout the app?",
    "In the \"Advisor (Review) Screen,\" how are user reviews and ratings displayed for each advisor? Are there interactive elements for users to leave their own reviews?",
    "What design considerations were taken into account for the \"Chat Screen to activate AI Assistant\" to ensure a seamless transition between the chat interface and activating the AI Assistant?",
    "How is the \"App Information Architecture (Outdated)\" screen different from the current information architecture design? What improvements or changes have been made to enhance the user experience?",
    "For the \"AI-nav\" component, how does the navigation flow change based on user interactions within the AI Assistant feature? Are there different states for active and inactive navigation options?",
    "In the \"Add to reading list\" component, how is the user prompted to add content to their reading list? Is there an indication of successful addition and easy access to the reading list feature?",
    "How is the \"Affiliation\" information displayed in the UI, especially in screens related to advisors or AI Assistant interactions? Are there visual cues to distinguish different affiliations effectively?",
    "How should the design adapt to different mobile screen sizes?",
    "What are the touch interaction patterns for mobile implementation?"
  ],
  "business_questions": [
    "How will implementing a native app rating prompt after advisory completion impact user engagement and retention rates in the financial advisory platform?",
    "What potential revenue streams can be leveraged through increased user satisfaction and positive app reviews resulting from the new feature?",
    "How will the native app rating prompt contribute to client acquisition efforts by showcasing positive user experiences?",
    "What efficiency gains can financial advisors expect from the streamlined process of collecting user feedback through the app rating prompt?",
    "What compliance considerations need to be addressed when implementing a native app rating prompt, especially in terms of data privacy and security?",
    "How can the risk of negative reviews and feedback be mitigated through strategic design and timing of the app rating prompt?",
    "In what ways will the native app rating prompt contribute to market differentiation and give the platform a competitive advantage in the financial advisory sector?",
    "How scalable is the implementation of the native app rating prompt across a growing user base and increasing number of advisory sessions?",
    "What resources, both in terms of development and maintenance, will be required to integrate the native app rating prompt and what return on investment can be expected?",
    "How will the integration of the native app rating prompt align with existing business processes related to client relationship management and feedback collection?",
    "What success metrics can be defined to measure the effectiveness of the native app rating prompt in improving user satisfaction and overall app performance?",
    "How can the implementation of a native app rating prompt align with appointment management workflows to ensure that user feedback is collected at the right touchpoints in the client journey?",
    "What impact will the native app rating prompt have on advisor-client relationships, and how can this feature be leveraged to enhance communication and trust?",
    "How can the data collected through the app rating prompt be used to personalize advisory sessions and tailor recommendations to individual user preferences?",
    "What steps can be taken to ensure that the native app rating prompt is accessible to all users, including those with disabilities or limited tech proficiency?"
  ],
  "technical_considerations": [
    "React Native platform-specific implementations",
    "App store deployment considerations",
    "High complexity design (Habitto AI Assistant & Chat Revamp (Copy)) may require additional development time",
    "High complexity design (Habitto App UI: Sprint Execution) may require additional development time"
  ],
  "clarifications_needed": [
    "Should this work on both iOS and Android?",
    "Are there specific mobile design guidelines to follow?",
    "Are the Figma designs final or still in review?",
    "Should the implementation match the designs exactly?"
  ],
  "risk_areas": [
    "Very complex design (Habitto AI Assistant & Chat Revamp (Copy)) may exceed estimated effort",
    "Very complex design (Habitto App UI: Sprint Execution) may exceed estimated effort",
    "Cross-platform compatibility testing required",
    "App store approval process may add timeline risk"
  ],
  "test_cases": [
    "**Functional Tests:**",
    "1. Test the core feature functionality by completing an advisory session and reopening the app to check if the native app rating prompt appears as expected.",
    "2. Test the user workflow by completing different types of advisory sessions and verifying that the rating prompt appears consistently on app reopening.",
    "3. Test the integration with existing financial advisory features by conducting an advisory session and checking if the rating prompt appears when reopening the app.",
    "4. Validate business rules by completing an advisory session and ensuring that the rating prompt follows the guidelines set in the knowledge base.",
    "5. Verify that the rating prompt does not appear if the user has not completed any advisory sessions.",
    "6. Test if the rating prompt is triggered only when the user arrives at the Sessions screen as specified in the acceptance criteria.",
    "7. Validate that the rating prompt does not interfere with the user's ability to view past sessions on the Sessions screen.",
    "8. Test the functionality of the rating prompt by clicking on it and confirming that it directs the user to the app store for reviewing the app.",
    "**Security & Compliance Tests:**",
    "1. Validate data protection and privacy by ensuring that user data is not shared when the rating prompt appears.",
    "2. Verify compliance with financial services regulations by confirming that the rating prompt does not request sensitive financial information.",
    "3. Test user authentication and authorization by checking if the rating prompt is displayed only for authenticated users.",
    "4. Confirm that the rating prompt activity is logged for audit trail purposes.",
    "**Performance & Reliability Tests:**",
    "1. Conduct response time testing by measuring the time taken for the rating prompt to appear after reopening the app.",
    "2. Test system stability under stress by repeatedly opening and closing the app to trigger the rating prompt.",
    "3. Validate error handling by intentionally triggering errors and checking if the app recovers gracefully.",
    "4. Verify data consistency by confirming that the rating prompt appears consistently for all completed advisory sessions.",
    "**User Experience Tests:**",
    "1. Test accessibility compliance by using screen readers to navigate to the Sessions screen and checking if the rating prompt is accessible.",
    "2. Validate cross-browser compatibility by opening the app on different browsers and confirming that the rating prompt appears consistently.",
    "3. Test user interface responsiveness by interacting with the rating prompt on various devices and screen sizes.",
    "4. Verify error message clarity by intentionally triggering errors and assessing the helpfulness of the messages displayed."
  ],
  "analysis_version": "1.0",
  "repository_context": null,
  "analysis_duration": 57.17396378517151,
  "question_count": 41,
  "test_case_count": 24,
  "risk_count": 4
}